### DataFrame에서 원소/요소 읽기
- 행 읽기 /열 읽기
- 행과 열이 교차하는 지점 원소/요소 읽기

In [30]:
# 
import pandas as pd

In [31]:
# 데이터 준비
jumsu = [[98,11,45],[34,77,90]]

In [32]:
# 2D 데이터를 DF로 저장
df1 = pd.DataFrame(jumsu)

In [33]:
df1

    0   1   2
0  98  11  45
1  34  77  90

In [34]:
# 행 인덱스 열 인덱스 속성으로 지정
# 행 인덱스 => 김경태, 안효준
# 열 인덱스 => 음악, 영어, 무용
df1.index=['김경태','안효준']
df1.columns=['음악','영어','사격']

In [35]:
df1

     음악  영어  사격
김경태  98  11  45
안효준  34  77  90

- [열/컬럼 선택] : 변수명[컬럼명/컬럼인덱스]

In [36]:
# 영어 과목 점수만 추출
df1['영어'],type(df1['영어'])

(김경태    11
 안효준    77
 Name: 영어, dtype: int64,
 pandas.core.series.Series)

In [37]:
# 무용 과목 점수만 추출
df1.사격  ## df1['무용']

김경태    45
안효준    90
Name: 사격, dtype: int64

In [39]:
# 음악,무용 컬럼만 추출
df1[['음악','사격']]

     음악  사격
김경태  98  45
안효준  34  90

In [40]:
# ERROR 
# df1['음악':'사격':2]

Empty DataFrame
Columns: [음악, 영어, 사격]
Index: []

In [42]:
df1['음악']

김경태    98
안효준    34
Name: 음악, dtype: int64

In [47]:
print(df1[df1.columns])

df1[df1.columns[::2]]

     음악  영어  사격
김경태  98  11  45
안효준  34  77  90

     음악  사격
김경태  98  45
안효준  34  90

- [행/로우 선택] : 변수명.iloc[행인덱스],변수명.loc[행인덱스]

In [ ]:
df1.iloc[0]

음악    98
영어    11
사격    45
Name: 김경태, dtype: int64

In [ ]:
# 여기서 i는 정수를 의미하므로 정수만 쓸수 있다
# df1.iloc[숫자인덱스]
# df1.iloc['김경태']

In [ ]:
#변수명.loc[행인덱스]
df1.loc['김경태']

음악    98
영어    11
사격    45
Name: 김경태, dtype: int64

In [48]:
# 여러개 행 추출
df1.loc[['안효준','김경태']]

     음악  영어  사격
안효준  34  77  90
김경태  98  11  45

In [51]:
df1.index , df1.index[1:],df1.index[::-1]

(Index(['김경태', '안효준'], dtype='object'),
 Index(['안효준'], dtype='object'),
 Index(['안효준', '김경태'], dtype='object'))

In [52]:
df1.loc[df1.index[::-1]]

     음악  영어  사격
안효준  34  77  90
김경태  98  11  45

- [요소/원소 추출] : 변수명.iloc[정수][열인덱스]/ 변수명.loc[행인덱스][열인덱스]

In [57]:
# 김경태님의 영어 점수만 추출
# df1['김경태']['영어'] #<--- keyError
df1.loc['김경태']['영어']

11

In [58]:
df1.iloc[0]['영어']

11

- [요소/원소 추출] 
     * 변수명.iloc[정수인덱스,열인덱스]/ 변수명.loc[행인덱스,열인덱스]

In [60]:
# 김경태님의 영어 점수만 추출
df1.iloc[0,1]  
## =>iloc[정수인덱스,정수인덱스] 
# df1.[0,'영어']

11

In [61]:
df1.loc['김경태','영어']

11

In [67]:
df1.iloc[0][::2] , df1.iloc[0,::2]

(음악    98
 사격    45
 Name: 김경태, dtype: int64,
 음악    98
 사격    45
 Name: 김경태, dtype: int64)

In [66]:
df1.loc[df1.index,'음악']

김경태    98
안효준    34
Name: 음악, dtype: int64